In [55]:
import pandas as pd

# Series

In [56]:
data = [1, 2, 3, 4, 5]

In [57]:
s = pd.Series(data)

In [58]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [59]:
index = ['Linha' + str(i) for i in range(5)]

In [60]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [61]:
# comando alterando o idex da series por um range com string através de uma lista
s = pd.Series(data = data,index = index)

In [62]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [63]:
data = {'Linha' + str(i) : i + 1 for i in range(5)}

In [64]:
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [65]:
# comando alterando o idex da series por um range com string através de um dicionário
s = pd.Series(data)
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [66]:
s1 = s + 2

In [67]:
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [68]:
# fazendo operações com 2 df
s2 = s + s1
s2

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

# Data Frame

In [69]:
data = [[1, 2, 3], 
        [4, 5, 6], 
        [7, 8, 9]]

In [70]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [71]:
df1 = pd.DataFrame(data = data)

In [72]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [73]:
# definindo o nome das linhas
index = ['Linha' + str(i) for i in range(3)]
index

['Linha0', 'Linha1', 'Linha2']

In [74]:
index

['Linha0', 'Linha1', 'Linha2']

In [75]:
df1 = pd.DataFrame(data = data, index = index)
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [76]:
# definindo o nome das colunas
columns = ['Coluna' + str(i) for i in range(3)]
columns

['Coluna0', 'Coluna1', 'Coluna2']

In [77]:
# forma padrão de definir os nomes das linhas e colunas em um df
df1 = pd.DataFrame(data = data, index = index, columns = columns)
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [78]:
data = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}
data

{'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [79]:
# outra forma de definir os nomes das linhas e colunas é através d eum conjunto de pares de dicionários
df2 = pd.DataFrame(data)
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [80]:
data = [(1, 2, 3), 
        (4, 5, 6), 
        (7, 8, 9)]

In [81]:
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [82]:
# df criado com tuplas
df3 = pd.DataFrame(data = data, index = index, columns = columns)
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [83]:
df1[df1 > 0] = 'A'
df1

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [84]:
df2[df2 > 0] = 'B'
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [85]:
df3[df3 > 0] = 'C'
df3

       Coluna0 Coluna1 Coluna2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [86]:
# concatenamento de df através de colunas
df4 = pd.concat([df1, df2, df3])
df4

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [87]:
# concatenamento de df através de linhas
df4 = pd.concat([df1, df2, df3], axis = 1)
df4

       Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2
Linha0       A       A       A       B       B       B       C       C       C
Linha1       A       A       A       B       B       B       C       C       C
Linha2       A       A       A       B       B       B       C       C       C